{
    "title": "Compute Node reboot windows",
    "description": "Notify users of many upcoming maintenance tasks of a similar kind in a single notification.",
    "subject": "Maintenance affecting your Joyent instance(s)",
    "version": "0.0.1",
    "ticket_type": "maintenance",
    "types": [
        "windows_vms"
    ],
    "required_fields": [
        "instance_uuid",
        "date_start",
        "date_end"
    ],
    "message": "Hello,\n\n#### General Information\n\nEach instance listed in the “Your Affected Instance(s)” section (at the bottom of this notice) has a physical host server that has been scheduled for a reboot within the date/time window specified, in order to apply the newest Operating System update:\n\n* To ensure that we continue to meet/exceed industry standards, this update will apply the latest features, along with further stability and performance enhancements.\n* The approximate down time for each affected instance will be under 20 minutes.\n\nIf you are running any applications that may be affected by a reboot, please plan accordingly.\n\nBased on customer feedback regarding previous maintenance events, we will be conducting these reboots outside of the normal working hours for each [data center] (https://docs.joyent.com/public-cloud/data-centers)’s local time zone. The “Your Affected Instance(s)” section at the bottom of this notice shows the time window for each of *your own affected instances*. Also, for broader reference, following is the *master schedule* by data center (DC), showing local time zones:\n\n```\n| DC     | DATE           | Time                |\n|--------|----------------|---------------------|\n| ams-1  | Aug 9, 2016    | 19:00 - 22:00 CEST  |\n| east-1 | Aug 9-11, 2016 | 03:00 - 06:00 EDT   |\n| east-2 | Aug 9, 2016    | 03:00 - 06:00 EDT   |\n| east-3 | Aug 9, 2016    | 03:00 - 06:00 EDT   |\n| sw-1   | Aug 9-10, 2016 | 03:00 - 06:00 PDT   |\n| west-1 | Aug 9-11, 2016 | 03:00 - 06:00 PDT   |\n```\n\n---------------------\n\n#### Rescheduling Requests\n\nAs a general rule, we will be unable to create alternative server maintenance schedules, because each host server is shared by multiple co-tenants, and because other operations and maintenance tasks have been calendared/staged before and after the maintenance windows shown below.\n\nWe may be able to accommodate some requests where there is potentially significant business impact, but all such requests for a change of schedule must be submitted before close of business on **29-July-2016.**\n\nYou also have the option to re-create your own instances and migrate applications and data (from your own backups) at any time before the scheduled reboot. Your new instances would *not* be created on servers that are scheduled for reboot during this maintenance session, but please note that their physical hosts could be included in *future* maintenance reboots.\n\n---------------------\n\n#### Important Information for Docker Containers\n\nYour container may not be set to restart automatically after the reboot. It is important to note that the Docker API does not allow us to set containers to restart by default.\n\nYou can set Docker containers to automatically restart by adding `--restart=always` to the Docker `run` command, or by adding `restart:always` to the Docker Compose yml file.\n\nSetting the Docker container to automatically restart may help containers recover from errors, including both application and compute node failures. This can improve uptime and eliminate the need for manual action to restart services.\n\nPlease review any currently running containers to ensure they are configured to automatically restart. We are also happy to help set any of your existing Docker containers to automatically restart for you. Please do not hesitate to respond to this notification should you prefer our assistance on this.\n\nFor more information about Docker restart policies, please visit [this page] (https://apidocs.joyent.com/docker/features/restart).\n\n---------------------\n\n#### Your Affected Instances\n\nFollowing is the applicable maintenance time window for each of your own affected instances, shown in [Coordinated Universal Time (UTC)] (http://www.timeanddate.com/worldclock/converter.html):\n\n"
}
